docs(mddocs): fix docs mistake
